#language: ru
Функционал: Выбор предмета


  Сценарий: Выбор телевизора на сайте yandex.ru.

  Когда произведен переход на яндекс маркет
  Когда выбран пункт меню – Электроника
  Когда выбран раздел – Телевизоры
  Когда заполнена цена от – 20000
  Когда выбран производитель – Samsung и LG
  Когда нажата кнопка применить
  Когда проверено, что элементов 12
  Тогда запоминается первый элемент в списке и проверяется значение

  Сценарий: Выбор наушников на сайте yandex.ru.

    Когда произведен переход на яндекс маркет
    Когда выбран пункт меню – Электроника
    Когда выбран раздел – Наушники и Bluetooth-гарнитуры
    Когда заполнена цена от – 5000
    Когда выбран производитель – Beats
    Когда нажата кнопка применить
    Когда проверено, что элементов 12
    Тогда запоминается первый элемент в списке и проверяется значение

