#language: ru
Функционал: Выбор телефона


Сценарий: Выбор телефона на сайте ozon.ru

Когда выбран пункт меню – Электроника
Когда выбрана категория – Телефоны
Когда выбран производитель – Apple
Когда заполнена цена от – 50000
Тогда появляются товары и добавляется первый товар в корзину, причем запоминается цена
Когда произведен переход в корзину
Когда проверено, что в корзине есть добавленный товар
Тогда нажимается на удалить всё
Тогда корзина пуста.

  Сценарий: Выбор телефона на сайте ozon.ru

    Когда выбран пункт меню – Электроника
    Когда выбрана категория – Зеркальные фотоаппараты
    Когда выбран производитель – Nikon, Canon
    Когда заполнена цена от – 80000
    Тогда появляются товары и добавляется первый товар в корзину, причем запоминается цена
    Когда произведен переход в корзину
    Когда проверено, что в корзине есть добавленный товар
    Тогда нажимается на удалить всё
    Тогда корзина пуста.

